==========
DATEDIFF
==========
%%[
set @startDate = '2022-04-01 8:30 AM'
set @endDate = '2023-04-02 8:31 AM'
OUTPUTLINE(dateDiff(@startDate, @endDate,"Y"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"M"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"D"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"H"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"MI"))
]%%
++++++++++
1
12
366
8784
527041
==========
DATEDIFF - DATES ONLY
==========
%%[
set @startDate = '12/31/2001'
set @endDate = '5/31/2002'
OUTPUTLINE(dateDiff(@startDate, @endDate,"Y"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"M"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"D"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"H"))
OUTPUTLINE(dateDiff(@startDate, @endDate,"MI"))
]%%
++++++++++
1
5
151
3624
217440
==========
DATEDIFF INVALID DATE
==========
%%[
var @date1
var @date2
var @diffType
var @result

set @date1 = "bogus"
set @date2 = "5/31/2002"
set @diffType = "MI"

set @result = datediff(@date1, @date2, @diffType)
]%%

%%=v(@result)=%%
++++++++++
!
==========
DATEDIFF INVALID DIFFTYPE
==========
%%[
var @date1
var @date2
var @diffType
var @result

set @date1 = "12/31/2001"
set @date2 = "5/31/2002"
set @diffType = "X"

set @result = datediff(@date1, @date2, @diffType)
]%%

%%=v(@result)=%%
++++++++++
!
==========
DATEDIFF EMPTY DATE
==========
%%[
var @date1
var @date2
var @diffType
var @result

set @date1 = ""
set @date2 = "5/31/2002"
set @diffType = "M"

set @result = datediff(@date1, @date2, @diffType)
]%%

%%=v(@result)=%%
++++++++++
!
==========
DATEPARSE EMPTY DATE
==========
%%[
set @result = DATEPARSE("")
]%%
%%=v(@result)=%%
++++++++++
!
==========
DATEPARSE Date
==========
%%[
set @result = DATEPARSE("2023-05-01")
]%%
%%=v(@result)=%%
++++++++++
5/1/2023 12:00:00 AM
==========
DATEPARSE DateTime
==========
%%[
set @result = DATEPARSE("2023-05-01 5:00:00")
]%%
%%=v(@result)=%%
++++++++++
5/1/2023 5:00:00 AM
==========
DATEPARSE DateTime with UTC
==========
%%[
set @result = DATEPARSE("2023-05-01 2:30PM-1:00", 1)
]%%
%%=v(@result)=%%
++++++++++
5/1/2023 3:30:00 PM
==========
DATEPARSE DateTime without UTC
==========
%%[
set @result = DATEPARSE("2023-05-01 2:30PM-1:00", 0)
]%%
%%=v(@result)=%%
++++++++++
5/1/2023 11:30:00 AM